In [6]:
#11
import pandas as pd
import numpy as np

np.random.seed(24)
data = {
    'A': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'B': [1.32921, -1.07082, -1.6264, 0.961538, np.nan, -1.33694, 0.121668, 0.354493, 1.68658, -0.12982],
    'C': [np.nan, -1.43871, 0.219565, 0.104011, 1.05774, 0.562861, 1.2076, 1.03753, -1.32596, 0.631523],
    'D': [-0.31628, 0.564417, 0.678805, np.nan, 0.165562, 1.39285, -0.00204021, -0.385684, 1.42898, -0.586538],
    'E': [-0.99081, 0.295722, 1.88927, 0.850229, np.nan, -0.063328, 1.6278, 0.519818, -2.08935, np.nan]
}

df = pd.DataFrame(data)
def color_negative_red(val):
    color = 'red' if pd.isnull(val) else 'black'
    return 'color: %s' % color

styled_df = df.style.applymap(color_negative_red)
styled_df

In [7]:
#12
print("Original array:")
print(df)
print("\nBackground:black - fontcolor:yelow")
df.style.set_properties(**{'background-color': 'black',
'color': 'yellow'})

Original array:
    A         B         C         D         E
0   1  1.329210       NaN -0.316280 -0.990810
1   2 -1.070820 -1.438710  0.564417  0.295722
2   3 -1.626400  0.219565  0.678805  1.889270
3   4  0.961538  0.104011       NaN  0.850229
4   5       NaN  1.057740  0.165562       NaN
5   6 -1.336940  0.562861  1.392850 -0.063328
6   7  0.121668  1.207600 -0.002040  1.627800
7   8  0.354493  1.037530 -0.385684  0.519818
8   9  1.686580 -1.325960  1.428980 -2.089350
9  10 -0.129820  0.631523 -0.586538       NaN

Background:black - fontcolor:yelow

In [11]:
#13
import pandas as pd
import numpy as np
pd.set_option('display.max_rows', None)
#pd.set_option('display.max_columns', None)
df = pd.DataFrame({
'ord_no':[70001,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan, 70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07- 27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001],
'salesman_id':[5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]})
print("Original Orders DataFrame:")
print(df)
print("\nMissing values of the said dataframe:")
print(df.isna())

Original Orders DataFrame:
     ord_no  purch_amt     ord_date  customer_id  salesman_id
0   70001.0     150.50   2012-10-05         3002       5002.0
1       NaN     270.65   2012-09-10         3001       5003.0
2   70002.0      65.26          NaN         3001       5001.0
3   70004.0     110.50   2012-08-17         3003          NaN
4       NaN     948.50   2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07- 27         3001       5001.0
6       NaN    5760.00   2012-09-10         3001       5001.0
7   70010.0    1983.43   2012-10-10         3004          NaN
8   70003.0    2480.40   2012-10-10         3003       5003.0
9   70012.0     250.45   2012-06-27         3002       5002.0
10      NaN      75.29   2012-08-17         3001       5003.0
11  70013.0    3045.60   2012-04-25         3001          NaN

Missing values of the said dataframe:
    ord_no  purch_amt  ord_date  customer_id  salesman_id
0    False      False     False        False        False
1     True      False     False        False        False
2    False      False      True        False        False
3    False      False     False        False         True
4     True      False     False        False        False
5    False      False     False        False        False
6     True      False     False        False        False
7    False      False     False        False         True
8    False      False     False        False        False
9    False      False     False        False        False
10    True      False     False        False        False
11   False      False     False        False         True

In [10]:
#14
import pandas as pd
import numpy as np
pd.set_option('display.max_rows', None)
#pd.set_option('display.max_columns', None)
df = pd.DataFrame({
'ord_no':[70001,np.nan,70002,70004,np.nan,70005,"-- ",70010,70003,70012,np.nan,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,"?",12.43,2480.4,250.45, 3045.6],
'ord_date': ['?','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09- 10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,"--",3002,3001,3001],
'salesman_id':[5002,5003,"?",5001,np.nan,5002,5001,"?",5003,5002,5003,"--"]})
print("Original Orders DataFrame:")
print(df)
print("\nReplace the missing values with NaN:")
result = df.replace({"?": np.nan, "--": np.nan})
print(result)

Original Orders DataFrame:
   ord_no purch_amt     ord_date customer_id salesman_id
0   70001     150.5            ?        3002        5002
1     NaN    270.65   2012-09-10        3001        5003
2   70002     65.26          NaN        3001           ?
3   70004     110.5   2012-08-17        3003        5001
4     NaN     948.5   2012-09-10        3002         NaN
5   70005    2400.6   2012-07-27        3001        5002
6     --       5760  2012-09- 10        3001        5001
7   70010         ?   2012-10-10        3004           ?
8   70003     12.43   2012-10-10          --        5003
9   70012    2480.4   2012-06-27        3002        5002
10    NaN    250.45   2012-08-17        3001        5003
11  70013    3045.6   2012-04-25        3001          --

Replace the missing values with NaN:
   ord_no  purch_amt     ord_date  customer_id  salesman_id
0   70001     150.50          NaN       3002.0       5002.0
1     NaN     270.65   2012-09-10       3001.0       5003.0
2   70002      65.26          NaN       3001.0          NaN
3   70004     110.50   2012-08-17       3003.0       5001.0
4     NaN     948.50   2012-09-10       3002.0          NaN
5   70005    2400.60   2012-07-27       3001.0       5002.0
6     --     5760.00  2012-09- 10       3001.0       5001.0
7   70010        NaN   2012-10-10       3004.0          NaN
8   70003      12.43   2012-10-10          NaN       5003.0
9   70012    2480.40   2012-06-27       3002.0       5002.0
10    NaN     250.45   2012-08-17       3001.0       5003.0
11  70013    3045.60   2012-04-25       3001.0          NaN

In [14]:
#15
import pandas as pd
import numpy as np
pd.set_option('display.max_rows', None)
#pd.set_option('display.max_columns', None)
df = pd.DataFrame({
'ord_no':[np.nan,np.nan,70002,np.nan,np.nan,70005,np.nan,70010,70003,70012,np.nan,np.nan],
'purch_amt':[np.nan,270.65,65.26,np.nan,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,np.nan],
'ord_date': [np.nan,'2012-09-10',np.nan,np.nan,'2012-09-10','2012-07-27','2012-09- 10','2012-10-10','2012-10-10','2012-06-27','2012-08-17',np.nan],
'customer_id':[np.nan,3001,3001,np.nan,3002,3001,3001,3004,3003,3002,3001,np.nan]})
print("Original Orders DataFrame:")
print(df)
print("\nKeep the rows with at least 2 NaN values of the said DataFrame:")
result = df.dropna(thresh=2)
print(result)

Original Orders DataFrame:
     ord_no  purch_amt     ord_date  customer_id
0       NaN        NaN          NaN          NaN
1       NaN     270.65   2012-09-10       3001.0
2   70002.0      65.26          NaN       3001.0
3       NaN        NaN          NaN          NaN
4       NaN     948.50   2012-09-10       3002.0
5   70005.0    2400.60   2012-07-27       3001.0
6       NaN    5760.00  2012-09- 10       3001.0
7   70010.0    1983.43   2012-10-10       3004.0
8   70003.0    2480.40   2012-10-10       3003.0
9   70012.0     250.45   2012-06-27       3002.0
10      NaN      75.29   2012-08-17       3001.0
11      NaN        NaN          NaN          NaN

Keep the rows with at least 2 NaN values of the said DataFrame:
     ord_no  purch_amt     ord_date  customer_id
1       NaN     270.65   2012-09-10       3001.0
2   70002.0      65.26          NaN       3001.0
4       NaN     948.50   2012-09-10       3002.0
5   70005.0    2400.60   2012-07-27       3001.0
6       NaN    5760.00  2012-09- 10       3001.0
7   70010.0    1983.43   2012-10-10       3004.0
8   70003.0    2480.40   2012-10-10       3003.0
9   70012.0     250.45   2012-06-27       3002.0
10      NaN      75.29   2012-08-17       3001.0

In [16]:
#16
import pandas as pd
pd.set_option('display.max_rows', None)
student_data = pd.DataFrame({
'school_code': ['s001','s002','s003','s001','s002','s004'],
'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill',
'David Parkes'],
'date_Of_Birth ':
['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
'age': [12, 12, 13, 13, 14, 12],
'height': [173, 192, 186, 167, 151, 159],
'weight': [35, 32, 33, 30, 31, 32],
'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']}, index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
print("Original DataFrame:")
print(student_data)
print('\nSplit the said data on school_code wise:')
result = student_data.groupby(['school_code'])
for name,group in result:
    print("\nGroup:")
    print(name)
    print(group)
    print("\nType of the object:")
    print(type(result))

Original DataFrame:
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S2        s002     V    Gino Mcneill     17/05/2002   12     192      32
S3        s003    VI     Ryan Parkes     16/02/1999   13     186      33
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30
S5        s002     V    Gino Mcneill     11/05/2002   14     151      31
S6        s004    VI    David Parkes     15/09/1997   12     159      32

    address
S1  street1
S2  street2
S3  street3
S4  street1
S5  street2
S6  street4

Split the said data on school_code wise:

Group:
('s001',)
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1

Type of the object:
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

Group:
('s002',)
   school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2

Type of the object:
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

Group:
('s003',)
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

Type of the object:
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

Group:
('s004',)
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

Type of the object:
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [18]:
#17
import pandas as pd
pd.set_option('display.max_rows', None)
#pd.set_option('display.max_columns', None)
student_data = pd.DataFrame({
'school_code': ['s001','s002','s003','s001','s002','s004'],
'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill',
'David Parkes'],
'date_Of_Birth ':
['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
'age': [12, 12, 13, 13, 14, 12],
' height ': [173, 192, 186, 167, 151, 159],
'weight': [35, 32, 33, 30, 31, 32],
'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']}, index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
print("Original DataFrame:")
print(student_data)
print('\nMean, min, and max value of age for each school with customized column names:')
grouped_single = student_data.groupby('school_code').agg(Age_Mean =
('age','mean'),Age_Max=('age',max),Age_Min=('age',min))
print(grouped_single)

Original DataFrame:
   school_code class            name date_Of_Birth   age   height   weight  \
S1        s001     V  Alberto Franco     15/05/2002   12       173      35
S2        s002     V    Gino Mcneill     17/05/2002   12       192      32
S3        s003    VI     Ryan Parkes     16/02/1999   13       186      33
S4        s001    VI    Eesha Hinton     25/09/1998   13       167      30
S5        s002     V    Gino Mcneill     11/05/2002   14       151      31
S6        s004    VI    David Parkes     15/09/1997   12       159      32

    address
S1  street1
S2  street2
S3  street3
S4  street1
S5  street2
S6  street4

Mean, min, and max value of age for each school with customized column names:
             Age_Mean  Age_Max  Age_Min
school_code
s001             12.5       13       12
s002             13.0       14       12
s003             13.0       13       13
s004             12.0       12       12

In [19]:
#18
import pandas as pd
pd.set_option('display.max_rows', None)
student_data = pd.DataFrame({
'school_code': ['s001','s002','s003','s001','s002','s004'],
'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill',
'David Parkes'],
'date_Of_Birth ':
['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
'age': [12, 12, 13, 13, 14, 12],
'height': [173, 192, 186, 167, 151, 159],
'weight': [35, 32, 33, 30, 31, 32],
'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']}, index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
print("Original DataFrame:")
print(student_data)
print('\nSplit the said data on school_code wise:')
result = student_data.groupby(['school_code'])
for name,group in result:
    print("\nGroup:")
    print(name)
    print(group)
    print("\nType of the object:")
    print(type(result))

Original DataFrame:
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S2        s002     V    Gino Mcneill     17/05/2002   12     192      32
S3        s003    VI     Ryan Parkes     16/02/1999   13     186      33
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30
S5        s002     V    Gino Mcneill     11/05/2002   14     151      31
S6        s004    VI    David Parkes     15/09/1997   12     159      32

    address
S1  street1
S2  street2
S3  street3
S4  street1
S5  street2
S6  street4

Split the said data on school_code wise:

Group:
('s001',)
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1

Type of the object:
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

Group:
('s002',)
   school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2

Type of the object:
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

Group:
('s003',)
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

Type of the object:
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

Group:
('s004',)
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

Type of the object:
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>